# language: bg
Функционалност: Статии
  Потребителите трябва да могат да обменят информация за това какви места са посетили
  и за какво са подходящи тези места

  Сценарий: Разглеждане на статия
    Дадено че сме вписани в системата
    И че има следните статии:
      | Автор        | Заглавие          | Съдържание | Околия      |
      | Петър Петров | Кременските езера | Нещо       | Благоевград |
      | Иван Иванов  | Вр. Каменица      | Нещо друго | Благоевград |
    Когато отида на страницата за статии
    То трябва да виждам следните статии:
      | Title             | Author        | Show | Edit |  |
      | Кременските езера | Петър Петров  | Show |      |  |
      | Вр. Каменица      | Иван Иванов   | Show |      |  |


  Сценарий: Добавяне на статия
    Дадено че сме вписани в системата
    И има околия
    Когато отида на страницата за нова статия
    И попълня нова статия
    То трябва да видя новата статия
