# language: bg
Функционалност: Статии
  Потребителите трябва да могат да обменят информация за това какви места са посетили
  и за какво са подходящи тези места

  Сценарий: Разглеждане на статия
    Дадено че сме вписани в системата
    И че има следните статии:
      | Автор        | Заглавие          | Съдържание | Околия      |
      | Петър Петров | Кременските езера | Нещо       | Благоевград |
      | Иван Иванов  | Вр. Каменица      | Нещо друго | Благоевград |
    Когато отида на страницата за статии
    То трябва да виждам следните статии:
      | Title             | Created At | Province    | Author        | Liking | Disliking | Following |
      | Кременските езера | 2012/02/14 | Благоевград | Петър Петров  | 0      | 0         | 0         |
      | Вр. Каменица      | 2012/02/14 | Благоевград | Иван Иванов   | 0      | 0         | 0         |


  Сценарий: Добавяне на статия
    Дадено че сме вписани в системата
    И има околия
    Когато отида на страницата за нова статия
    И попълня нова статия
    То трябва да видя новата статия

  Сценарий: Харесване на статия
    Дадено че сме вписани в системата
    И има статия
    Когато отида на станицата на първата статия
    И натисна "Like"
    То трябва статията да е харесана "1" път и да не е харесана "0" пъти

  Сценарий: Нехаресване на статия
    Дадено че сме вписани в системата
    И има статия
    Когато отида на станицата на първата статия
    И натисна "Dislike"
    То трябва статията да е харесана "0" пъти и да не е харесана "1" път

  Сценарий: Промяна на мнението за статия
    Дадено че сме вписани в системата
    И има статия
    Когато отида на станицата на първата статия
    И натисна "Dislike"
    И натисна "Like"
    То трябва статията да е харесана "1" път и да не е харесана "0" пъти

  Сценарий: Добавяне на коментар
    Дадено че сме вписани в системата
    И има статия
    Когато отида на станицата на първата статия
    И попълня "comment_content" с "larodi"
    И натисна "Create Comment"
    То трябва да има коментар с тяло "larodi"

